InformationRegisters/СопутствующиеТоварыИУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СопутствующиеТоварыИУслуги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>#12082 отключена проверка заполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеКоличество</Name>
					<Comment>#88</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОкругленияЧислом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СопутствующийТовар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаСопутствующегоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СопутствующиеТоварыИУслуги/Forms/ФормаПодбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// настройка для розницы
	ДопустимаяГлубинаВложенности = Константы.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг.Получить();
	
	// №14840
	Параметры.Свойство("СФормыПодбора", СФормыПодбора);
	Если СФормыПодбора = Истина Тогда
		// с формы подбора для заказа покупателя
		ДопустимаяГлубинаВложенности = 1;	
	КонецЕсли;
		
	ИсходнаяТаблица.Очистить();
	
	Если Параметры.Свойство("МассивПозиций") Тогда
		
		Для каждого ЭлементМассива из Параметры.МассивПозиций Цикл
			НоваяСтрока = ИсходнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		КонецЦикла;
		
		Если ИсходнаяТаблица.Количество() = 1 Тогда
			Заголовок = "Подбор сопутствующих товаров для номенклатуры: " + ИсходнаяТаблица[0].Номенклатура;
			Если ЗначениеЗаполнено(ИсходнаяТаблица[0].ХарактеристикаНоменклатуры) Тогда
				Заголовок = Заголовок + ", " + ИсходнаяТаблица[0].ХарактеристикаНоменклатуры;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Заголовок = "Подбор сопутствующих товаров для номенклатуры: " + Параметры.Номенклатура;
		Если ЗначениеЗаполнено(Параметры.ХарактеристикаНоменклатуры) Тогда
			Заголовок = Заголовок + ", " + Параметры.ХарактеристикаНоменклатуры;
		КонецЕсли;	
		
		//ИсходнаяНоменклатура = Параметры.Номенклатура;
		//ИсходноеКоличество = Параметры.Количество;	
		//ИсходнаяХарактеристика = Параметры.ХарактеристикаНоменклатуры;
		//ИсходнаяУИСтроки = Параметры.УИСтроки;
		
		НоваяСтрока = ИсходнаяТаблица.Добавить();
		НоваяСтрока.Номенклатура = Параметры.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Параметры.ХарактеристикаНоменклатуры;
		НоваяСтрока.Количество = Параметры.Количество;		
		НоваяСтрока.УИСтроки = Параметры.УИСтроки;

	КонецЕсли;
	
	СтрокиДерева = ДеревоСопутствующейНоменклатуры.ПолучитьЭлементы();
	ТекИндекс = 0;
	
	Для каждого СтрокаТабличнойЧасти из ИсходнаяТаблица Цикл		
		СтруктураПодбора = Новый Структура("УИСтрокиПодбора", СтрокаТабличнойЧасти.УИСтроки);
		ЕстьСопутка = ДобавитьСопутствующуюНоменклатуру(СтрокаТабличнойЧасти, СтруктураПодбора, СтрокиДерева, 1);
		Если ЕстьСопутка И ИсходнаяТаблица.Количество() > 1 Тогда
			// строка номенклатуры подбора  
			НоваяСтрока = СтрокиДерева.Вставить(ТекИндекс);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			НоваяСтрока.ЭтоНоменклатураПодбора = Истина;
			ТекИндекс = СтрокиДерева.Количество();
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиДерева.Количество() = 0 Тогда
		
		// №14840 когда с формы подбора товаров, сообщения не выводим, просто закрываем форму
		Если СФормыПодбора Тогда
			Отказ = Истина;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранной позиции отсутствуют сопутствующие товары", ,,, Отказ);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, "ВыбраннаяНоменклатураНоменклатураАртикул");
	
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент И НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		АдресВХранилище = ЗаписатьПодборВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресВХранилище <> Неопределено Тогда
		Структура = Новый Структура("АдресВХранилище", АдресВХранилище);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ВыбраннаяНоменклатураПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяНоменклатураПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСопутствующейНоменклатурыЕдиницаИзмеренияПриИзменении(Элемент)
		
	СтрокаТабличнойЧасти = Элементы.ДеревоСопутствующейНоменклатуры.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодульВызовСервера.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСопутствующейНоменклатурыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.ДеревоСопутствующейНоменклатуры.ТекущиеДанные;
	СписокЕдиниц =  ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСопутствующейНоменклатурыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.ДеревоСопутствующейНоменклатуры.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодульВызовСервера.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//++ №14840
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из ВыбраннаяСопутствующаяНоменклатура Цикл
		ТекущаяСтрока.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из ВыбраннаяСопутствующаяНоменклатура Цикл
		ТекущаяСтрока.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры
//-- №14840

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ВыбраннаяСопутствующаяНоменклатура.Очистить();
	СтрокиДерева = ДеревоСопутствующейНоменклатуры.ПолучитьЭлементы();
	ДеревоСопутствующейНоменклатурыВТаблицу(СтрокиДерева);
	
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСопутствующейНоменклатурыВТаблицу(Строки)
	
	Для каждого Строка из Строки Цикл
		Если Строка.Пометка И НЕ Строка.ЭтоНоменклатураПодбора Тогда
			НоваяСтрока = ВыбраннаяСопутствующаяНоменклатура.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			ПодСтроки = Строка.ПолучитьЭлементы();
			Если ПодСтроки.Количество() > 0 Тогда
				ДеревоСопутствующейНоменклатурыВТаблицу(ПодСтроки);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// оформление строки 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСопутствующейНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСопутствующейНоменклатуры.ЭтоНоменклатураПодбора");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, 10, Истина)); // жирным
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьПодборВХранилище(УникальныйИдентификаторВладельца) 
	
	ТаблицаНоменклатуры = ВыбраннаяСопутствующаяНоменклатура.Выгрузить();
	КоличествоСтрок = ТаблицаНоменклатуры.Количество();
	Для Индекс = 1 По КоличествоСтрок Цикл
		Если НЕ ТаблицаНоменклатуры[КоличествоСтрок - Индекс].Пометка Тогда
			ТаблицаНоменклатуры.Удалить(КоличествоСтрок - Индекс);	
		КонецЕсли;
	КонецЦикла;
		
	АдресВХранилище = Неопределено;	
	Если ПеренестиВДокумент Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаНоменклатуры, УникальныйИдентификаторВладельца);	
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

//++ №14840
&НаСервере
Процедура ОбновитьВидимостьЭлементовФормы()
	
	// с формы подбора разрешаем редактировать количество и делаем свои кнопки "Добавить" и "Отмена"
	Элементы.ВыбраннаяНоменклатураКоличество.ТолькоПросмотр = (НЕ СФормыПодбора);
	Элементы.ГруппаКомандПодбора.Видимость = СФормыПодбора;
	Элементы.ФормаПеренестиВДокумент.Видимость = (НЕ СФормыПодбора);
	
КонецПроцедуры
//-- №14840

&НаКлиенте
Процедура ДеревоСопутствующейНоменклатурыПометкаПриИзменении(Элемент)
	
	Идентификатор = Элементы.ДеревоСопутствующейНоменклатуры.ТекущаяСтрока;
	Пометка = Элементы.ДеревоСопутствующейНоменклатуры.ТекущиеДанные.Пометка;
	ТекущаяСтрока = ДеревоСопутствующейНоменклатуры.НайтиПоИдентификатору(Идентификатор);
	Если НЕ Пометка Тогда
		СнятьфлажокПодчиненного(ТекущаяСтрока);
	КонецЕсли;	
	Если Пометка Тогда
		УстановитьФлажокРодителя(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьфлажокПодчиненного(Строка)
	
	Для Каждого ПодСтрока Из Строка.ПолучитьЭлементы() Цикл
        ПодСтрока.Пометка = Ложь;
		СнятьфлажокПодчиненного(ПодСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажокРодителя(Строка)
		
	Родитель = Строка.ПолучитьРодителя();
	Если НЕ Родитель = Неопределено Тогда
		Родитель.Пометка = Истина;
		УстановитьФлажокРодителя(Родитель);
	КонецЕсли;
	
КонецПроцедуры

//#16036
&НаСервере
Функция ДобавитьСопутствующуюНоменклатуру(СтрокаТабличнойЧасти, СтруктураПодбора, СтрокиДерева, Уровень) 
	
	Если Уровень > ДопустимаяГлубинаВложенности Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура",   СтрокаТабличнойЧасти.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Количество",     СтрокаТабличнойЧасти.Количество);
	Запрос.УстановитьПараметр("УИСтроки",       СтрокаТабличнойЧасти.УИСтроки);
	Запрос.УстановитьПараметр("Уровень",        Уровень);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК Пометка,
	|	&Уровень КАК Уровень,
	|	&Номенклатура КАК ИсходнаяНоменклатура,
	|	&Характеристика КАК ИсходнаяХарактеристикаНоменклатуры,
	|	&Количество КАК ИсходноеКоличество,
	|	&УИСтроки КАК ИсходныйУИСтроки,
	|	СопутствующиеТовары.СопутствующийТовар КАК Номенклатура,
	|	СопутствующиеТовары.ХарактеристикаСопутствующегоТовара КАК ХарактеристикаНоменклатуры,
	|	СопутствующиеТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СопутствующиеТовары.Коэффициент КАК Коэффициент,
	|	СопутствующиеТовары.Количество КАК Количество,
	|	СопутствующиеТовары.ФиксированноеКоличество КАК ФиксированноеКоличество,
	|	СопутствующиеТовары.Комментарий КАК Комментарий,
	|	СопутствующиеТовары.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|	СопутствующиеТовары.ПорядокОкругленияЧислом КАК ПорядокОкругленияЧислом
	|ИЗ
	|	РегистрСведений.СопутствующиеТоварыИУслуги КАК СопутствующиеТовары
	|ГДЕ
	|	СопутствующиеТовары.Номенклатура = &Номенклатура
	|	И СопутствующиеТовары.Характеристика = &Характеристика";	
	
	РезультатЗапроса = Запрос.Выполнить();
	ЕстьСопутка = НЕ РезультатЗапроса.Пустой();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		
		НоваяСтрока = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПодбора);
		
		НоваяСтрока.УИСтроки = Строка(Новый УникальныйИдентификатор());			
		НоваяСтрока.УИСтрокиРодителя = Выборка.ИсходныйУИСтроки;
		
		Если Выборка.ФиксированноеКоличество Тогда
			НоваяСтрока.Количество =  Выборка.Количество;
		ИначеЕсли Выборка.ПорядокОкругленияЧислом > 0 Тогда
			//Округляем до точности указанной в "ПорядокОкругленияЧислом" 
			РасчетноеКоличество = Выборка.Количество * СтрокаТабличнойЧасти.Количество;
			КратПоПорядкуОкругления = Окр(РасчетноеКоличество/Выборка.ПорядокОкругленияЧислом, 0);
			ОкругленноеКоличество = КратПоПорядкуОкругления * Выборка.ПорядокОкругленияЧислом;
			Остаток = РасчетноеКоличество - ОкругленноеКоличество;
			Если Остаток > 0 И (Остаток > Выборка.ПорядокОкругленияЧислом/2 ИЛИ Выборка.ОкруглятьВБольшуюСторону) Тогда
				ОкругленноеКоличество = ОкругленноеКоличество + Выборка.ПорядокОкругленияЧислом;
			КонецЕсли;	
			НоваяСтрока.Количество = ОкругленноеКоличество;
		Иначе
			НоваяСтрока.Количество = Выборка.Количество * СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		
		ПодСтрокиДерева = НоваяСтрока.ПолучитьЭлементы();
		ДобавитьСопутствующуюНоменклатуру(НоваяСтрока, СтруктураПодбора, ПодСтрокиДерева, Уровень + 1);
		
	КонецЦикла;	
	
	Возврат ЕстьСопутка;
		
КонецФункции

#КонецОбласти
